/** 
 * File:   Lib_H_PIC_oscillators.c
 * Author: Isaev
 *
 * Created on 8 октября 2017 г., 17:00
 */

//******************************************************************************
// Секция include: здесь подключается заголовочный файл к модулю
#include "Lib_H_PIC_oscillators.h"
//******************************************************************************


//******************************************************************************
//------------------------------------------------------------------------------
// Глобальные переменные
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
// Локальные переменные
//------------------------------------------------------------------------------
//******************************************************************************


//******************************************************************************
// Секция прототипов локальных функций
//******************************************************************************


//******************************************************************************
// Секция описания функций (сначала глобальных, потом локальных)
//==============================================================================
//------------------------------------------------------------------------------
// Функции для микроконтроллера серии "PIC24H"
#if defined (__PIC24H__)

/**
 *  @brief  Функция конфигурирует тактовый генератор микроконтроллера со следующими 
 *          параметрами:
 *              HS - 8MHz (веншний тактовый генератор как источник импульсов);
 *              FOSC - 64MHz;
 *              FCY - 32MIPS;
 */
void PIC_Init_Oscillator_HS_8MHz_FOSC_64MHz_FCY_32MIPS(void)
{
    CLKDIVbits.ROI = 0; //              1 = Interrupts will clear the DOZEN bit and the processor clock/peripheral clock ratio is set to 1:1
    //                                  0 = Interrupts have no effect on the DOZEN bit 

    //  DOZE<2:0>: Processor Clock Reduction Select bits
    CLKDIVbits.DOZE = 0; //             111 = FCY/128
    //                                  110 = FCY/64
    //                                  101 = FCY/32
    //                                  100 = FCY/16
    //                                  011 = FCY/8 (default)
    //                                  010 = FCY/4
    //                                  001 = FCY/2
    //                                  000 = FCY/1

    //  DOZEN: DOZE Mode Enable bit
    //    CLKDIVbits.DOZEN = 0; //            1 = DOZE<2:0> field specifies the ratio between the peripheral clocks and the processor clocks
    //                                  0 = Processor clock/peripheral clock ratio forced to 1:1

    //  PLLPOST<1:0>: PLL VCO Output Divider Select bits (also denoted as ‘N2’, PLL postscaler)
    CLKDIVbits.PLLPOST = 0; //          00 = Output/2
    //                                  01 = Output/4 (default)
    //                                  10 = Reserved
    //                                  11 = Output/8

    //  PLLPRE<4:0>: PLL Phase Detector Input Divider bits (also denoted as ‘N1’, PLL prescaler)
    CLKDIVbits.PLLPRE = 0; //           00000 = Input/2 (default)
    //                                  00001 = Input/3
    //                                  •••
    //                                  11111 = Input/33

    //  PLL Feedback Divisor bits (also denoted as ‘M’, PLL multiplier)
    PLLFBDbits.PLLDIV = 0b000001110; // 000000000 = 2
    //                                  000000001 = 3
    //                                  000000010 = 4
    //                                  •
    //                                  •
    //                                  •
    //                                  000110000 = 50 (default)
    //                                  •
    //                                  •
    //                                  •
    //                                  111111111 = 513

    while (OSCCONbits.LOCK != 1);

    RCONbits.SWDTEN = 0; //             Disable Watch Dog Timer
}
#endif   
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
// Функции для микроконтроллера серии "PIC24E"
#if defined (__PIC24E_) 
#endif
//------------------------------------------------------------------------------
//==============================================================================
//******************************************************************************


////////////////////////////////////////////////////////////////////////////////
// END OF FILE
////////////////////////////////////////////////////////////////////////////////
